src/config/Reports/XYZАнализПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>XYZАнализПродаж</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАнализа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовАнализа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСвойстваИКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскрашиватьГруппировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрАнализа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрXКлассаНач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрXКлассаКон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрYКлассаНач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрYКлассаКон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрZКлассаНач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрZКлассаКон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборФлагКласс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборВидСравненияКласс</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЗначениеКласс</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:EnumRef.XYZКлассификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиДиаграммы</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/config/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ПродажиСебестоимость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиСебестоимость</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Регламентный документ, сформировавший движения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Comment>Документ, к которому относится данное движение</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Enums/XYZКлассификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>XYZКлассификация</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>XКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZКласс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Reports/XYZАнализПродаж/Ext/ObjectModule.bsl
// СписокЗначений - список имен и представлений объектов анализа
Перем мСписокОбъектов Экспорт;

// Структура - соответствие имен полей и их представления для построителя отчетов
Перем мСтруктураСоответствияИмен Экспорт;

// Число - количество строк табличного документа, соответствующее заголовку отчета
Перем мКоличествоВыведенныхСтрокЗаголовка Экспорт;

// Число - индекс группировки, в которой содержится объект анализа
Перем мИндексГруппировкиОбъекта;

// Дата - дата начала периода анализа
Перем мДатаНачала;

// Таблица с данными для диаграммы
Перем ТаблицаДиаграммы Экспорт;

// Структура, ключи которой - имена отборов Построителя, значения - параметры Построителя
Перем мСтруктураДляОтбораПоКатегориям Экспорт;

// Процедура определяет и устанавливает значение для реквизита ОтборЗначениеКласс в зависимости от вида сравнения
// 
// Параметры
//  НЕТ
// 
// Возвращаемое значение
//  НЕТ
// 
Процедура ОпределитьТипЗначенияОтбораКласса() Экспорт

	Если ОтборВидСравненияКласс = ВидСравнения.Равно ИЛИ ОтборВидСравненияКласс = ВидСравнения.НеРавно Тогда
		Если ОтборЗначениеКласс = Неопределено Тогда
			ОтборЗначениеКласс = Перечисления.XYZКлассификация.ПустаяСсылка();
		ИначеЕсли ТипЗнч(ОтборЗначениеКласс) = Тип("СписокЗначений") Тогда
			Если ОтборЗначениеКласс.Количество() > 0 Тогда
				ОтборЗначениеКласс = ОтборЗначениеКласс[0].Значение;
			Иначе
				ОтборЗначениеКласс = Перечисления.XYZКлассификация.ПустаяСсылка();
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		Если ОтборЗначениеКласс = Неопределено Тогда
			ОтборЗначениеКласс = Новый СписокЗначений;
		ИначеЕсли ТипЗнч(ОтборЗначениеКласс) = Тип("ПеречислениеСсылка.XYZКлассификация") Тогда
			НовыйСписок = Новый СписокЗначений;
			Если НЕ ОтборЗначениеКласс.Пустая() Тогда
				НовыйСписок.Добавить(ОтборЗначениеКласс);
			КонецЕсли; 
			ОтборЗначениеКласс = НовыйСписок;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

// Процедура меняет видимость заголовка поля табличного документа
// 
// Параметры
//  Таб - табличный документ
//
// Возвращаемые значения
//  НЕТ
Процедура ИзменитьВидимостьЗаголовка(Таб) Экспорт

	ОбластьВидимости = Таб.Область(1,,мКоличествоВыведенныхСтрокЗаголовка,);
	ОбластьВидимости.Видимость = ПоказыватьЗаголовок;

КонецПроцедуры

// Функция формирует строку представления периода отчета
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   Строка
//
Функция СформироватьСтрокуПериода() Экспорт

	ОписаниеПериода = "";
	
	// Вывод заголовка, описателя периода и фильтров и заголовка
	Если мДатаНачала = '00010101000000' И ДатаОкончания = '00010101000000' Тогда

		ОписаниеПериода     = "Период не установлен";

	Иначе

		Если мДатаНачала = '00010101000000' ИЛИ ДатаОкончания = '00010101000000' Тогда

			ОписаниеПериода = "Период: " + Формат(мДатаНачала, "ДФ = ""дд.ММ.гггг""; ДП = ""...""") 
							+ " - "      + Формат(ДатаОкончания, "ДФ = ""дд.ММ.гггг""; ДП = ""...""");

		Иначе

			Если мДатаНачала <= ДатаОкончания Тогда
				ОписаниеПериода = "Период: " + ПредставлениеПериода(НачалоДня(мДатаНачала), КонецДня(ДатаОкончания), "ФП = Истина");
			Иначе
				ОписаниеПериода = "Неправильно задан период!"
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Возврат ОписаниеПериода;
	
КонецФункции

// Процедура заполняет данными таблицу значений, распределяет объекты отчета по АВС-классам
// 
// Параметры
//  Выборка                - ВыборкаИзРезультатаЗапроса, по группировке объекта отчета
//  ТаблицаКлассовОбъектов - таблица значений, таблица с распределенными объектами отчета по классам
//
// Возвращаемые значения
//  НЕТ
//
Процедура ЗаполнитьТаблицуКлассовОбъектов(Выборка, ТаблицаКлассовОбъектов)

	ВыборкаОбъектов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, ОбъектАнализа);
	Пока ВыборкаОбъектов.Следующий() Цикл

		СуммаПараметровЗаВсеПериоды = 0;
		СтадияКонтрагента   = Перечисления.СтадииВзаимоотношенийСПокупателями.ПустаяСсылка();
		КлассКонтрагента    = Перечисления.XYZКлассификация.ПустаяСсылка();

		Если ПараметрАнализа = "ИнтервалыМеждуРасходнымиДокументами" Тогда
			СуммаПараметровЗаВсеПериоды = КонецДня(ДатаОкончания) - НачалоДня(мДатаНачала);
		Иначе
			СуммаПараметровЗаВсеПериоды = ВыборкаОбъектов[ПараметрАнализа];
		КонецЕсли; 
		
		Если ПараметрАнализа = "ИнтервалыМеждуРасходнымиДокументами" Тогда
			КолПериодовДок = ?(ВыборкаОбъектов.ДокументПродажи <> NULL, ВыборкаОбъектов.ДокументПродажи, 0) + 1;
			СреднееЗначениеПараметра = СуммаПараметровЗаВсеПериоды/КолПериодовДок;
		Иначе
			СреднееЗначениеПараметра = ?(КоличествоПериодовАнализа = 0, 0, (СуммаПараметровЗаВсеПериоды/КоличествоПериодовАнализа));
		КонецЕсли; 

		СуммаПодкоренногоВыражения = 0;

		НомерПериода = 0;

		Если ПараметрАнализа = "ИнтервалыМеждуРасходнымиДокументами" Тогда

			ВыборкаДокументов = ВыборкаОбъектов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДокументПродажи");

			ДатаПрошлогоДокумента = НачалоДня(мДатаНачала);
			
			Пока ВыборкаДокументов.Следующий() Цикл

				Если ВыборкаДокументов.ДокументПродажи = NULL Тогда
					Продолжить;
				КонецЕсли; 

				Если ВыборкаДокументов.ДокументПродажи <> Неопределено Тогда
					СуммаЗаПериод = ВыборкаДокументов.ДокументПродажи.Дата - ДатаПрошлогоДокумента;
					ДатаПрошлогоДокумента = ВыборкаДокументов.ДокументПродажи.Дата;
				Иначе
					СуммаЗаПериод = 0;
				КонецЕсли; 

				СуммаПодкоренногоВыражения = СуммаПодкоренногоВыражения + Pow((СуммаЗаПериод - СреднееЗначениеПараметра), 2);

			КонецЦикла;

			СуммаЗаПериод = КонецДня(ДатаОкончания) - ДатаПрошлогоДокумента;
			СуммаПодкоренногоВыражения = СуммаПодкоренногоВыражения + Pow((СуммаЗаПериод - СреднееЗначениеПараметра), 2);
	
		Иначе

			ВыборкаПериодов = ВыборкаОбъектов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "Все");
			Пока ВыборкаПериодов.Следующий() Цикл
				
				Если ВыборкаПериодов.Период = NULL Тогда
					Продолжить;
				Иначе
					Если ВыборкаПериодов[ПараметрАнализа] = NULL Тогда
						СуммаПодкоренногоВыражения = СуммаПодкоренногоВыражения + Pow((0 - СреднееЗначениеПараметра), 2);
					Иначе
						СуммаПодкоренногоВыражения = СуммаПодкоренногоВыражения + Pow((ВыборкаПериодов[ПараметрАнализа] - СреднееЗначениеПараметра), 2);
					КонецЕсли; 
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ПараметрАнализа = "ИнтервалыМеждуРасходнымиДокументами" Тогда

			ЗначениеКорня = SQRT(?(КолПериодовДок = 0, 0, (СуммаПодкоренногоВыражения/КолПериодовДок)));
			
		Иначе

			ЗначениеКорня = SQRT(?(КоличествоПериодовАнализа = 0, 0, (СуммаПодкоренногоВыражения/КоличествоПериодовАнализа)));
		
		КонецЕсли; 

		КоэфОтносительнойВариации = ?(СреднееЗначениеПараметра = 0, 0, (ЗначениеКорня*100/СреднееЗначениеПараметра));

		НоваяСтрока = ТаблицаКлассовОбъектов.Добавить();
		НоваяСтрока.Объект = ВыборкаОбъектов[ОбъектАнализа];
		НоваяСтрока.КоэффициентВариации = КоэфОтносительнойВариации;
		Для каждого Показатель Из Показатели Цикл
			Если Показатель.Использование ИЛИ (Показатель.Имя = ПараметрАнализа И ПараметрАнализа <> "ИнтервалыМеждуРасходнымиДокументами") Тогда
				НоваяСтрока[Показатель.Имя] = ВыборкаОбъектов[Показатель.Имя];
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЦикла;
	
	ТаблицаКлассовОбъектов.Сортировать("КоэффициентВариации ВОЗР");

	Для каждого Строки Из ТаблицаКлассовОбъектов Цикл
		
		Если Строки.КоэффициентВариации > ПараметрXКлассаНач И Строки.КоэффициентВариации <= ПараметрXКлассаКон Тогда
			Строки.Класс = Перечисления.XYZКлассификация.XКласс;
		ИначеЕсли Строки.КоэффициентВариации > ПараметрYКлассаНач И Строки.КоэффициентВариации <= ПараметрYКлассаКон Тогда
			Строки.Класс = Перечисления.XYZКлассификация.YКласс;
		ИначеЕсли Строки.КоэффициентВариации > ПараметрZКлассаНач И Строки.КоэффициентВариации <= ПараметрZКлассаКон Тогда
			Строки.Класс = Перечисления.XYZКлассификация.ZКласс;
		Иначе
			Строки.Класс = Перечисления.XYZКлассификация.ПустаяСсылка();
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Функция определяет, соответствие выводимых значений в табличный документ
//  отбору по АВС-классиифкации
//
// Параметры
//  Класс - ПеречислениеСсылка.XYZКлассификация, для которой определяет принадлежность к отбору
//
// Возвращаемое значение:
//   Булево, удовлетворяет или нет условиям отбора
//
Функция ПроверитьКлассВОтборе(Класс)

	УдовлетворяетОтбору = Истина;
	
	Если ОтборФлагКласс Тогда
		Если ОтборВидСравненияКласс = ВидСравнения.Равно Тогда
			Если ОтборЗначениеКласс <> Класс Тогда
				УдовлетворяетОтбору = Ложь;
			КонецЕсли; 
		ИначеЕсли ОтборВидСравненияКласс = ВидСравнения.НеРавно Тогда
			Если ОтборЗначениеКласс = Класс Тогда
				УдовлетворяетОтбору = Ложь;
			КонецЕсли; 
		ИначеЕсли ОтборВидСравненияКласс = ВидСравнения.ВСписке Тогда
			Если ОтборЗначениеКласс.НайтиПоЗначению(Класс) = Неопределено Тогда
				УдовлетворяетОтбору = Ложь;
			КонецЕсли; 
		ИначеЕсли ОтборВидСравненияКласс = ВидСравнения.НеВСписке Тогда
			Если ОтборЗначениеКласс.НайтиПоЗначению(Класс) <> Неопределено Тогда
				УдовлетворяетОтбору = Ложь;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат УдовлетворяетОтбору;

КонецФункции // ПроверитьКлассВОтборе()


// Процедура передает построителю отчета запрос
//
// Параметры
//  НЕТ
//
// Возвращаемое значение
//  НЕТ
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт

	Если ОбъектАнализа <> "Номенклатура" И ОбъектАнализа <> "Контрагент" И ОбъектАнализа <> "ОсновнойМенеджерПокупателя" Тогда
		Возврат;
	КонецЕсли;
	
	Если Периодичность.Пустая() Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса = "
	
	|ВЫБРАТЬ //РАЗЛИЧНЫЕ
	|	Продажи." + ОбъектАнализа + "                        КАК " + ОбъектАнализа + ",
	|	СУММА(Продажи.СтоимостьОборот)                КАК СуммаВыручки,
	|	СУММА(ВЫБОР КОГДА ЦенаСебестоимости.ЦенаНоменклатуры ЕСТЬ NULL ТОГДА
	|		Продажи.СтоимостьОборот
	|	ИНАЧЕ
	|		Продажи.СтоимостьОборот - (ЦенаСебестоимости.ЦенаНоменклатуры * Продажи.КоличествоОборот)
	|	КОНЕЦ)                                               КАК СуммаВаловойПрибыли,
	|	СУММА(Продажи.КоличествоОборот)               КАК КоличествоПроданныхТоваров,
	|";
	
	Если ПараметрАнализа = "ИнтервалыМеждуРасходнымиДокументами" Тогда
	
		ТекстЗапроса = ТекстЗапроса + "
		|	Продажи.ДокументПродажи КАК ДокументПродажи
		|";
		
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + "
		|	Продажи.Период КАК Период
		|";
		
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|	{ВЫБРАТЬ
	|		Продажи.Номенклатура.*,
	|		Продажи.ДокументПродажи.*,
	|		Продажи." + ОбъектАнализа + ".*
	|	//СВОЙСТВА
	|	}
	|
	|ИЗ
	|
	|	(
	|	ВЫБРАТЬ
	|		Продажи.ДокументПродажи                                           КАК ДокументПродажи,
	|		Продажи.Период                                                    КАК Период,
	|		Продажи.Номенклатура                                              КАК Номенклатура,
	|		Продажи.ДоговорКонтрагента.Владелец                            КАК Контрагент,
	|		Продажи.ДоговорКонтрагента.Владелец.ОсновнойМенеджерПокупателя КАК ОсновнойМенеджерПокупателя,
	|		СУММА(Продажи.СтоимостьОборот)                                    КАК СтоимостьОборот,
	|		СУММА(Продажи.КоличествоОборот)                                   КАК КоличествоОборот
	|
	|	ИЗ
	|
	|		РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, " + ПолучитьИмяЭлементаПеречисленияПоЗначению(Периодичность) + ", (ДоговорКонтрагента <> &ПустойДоговор И Номенклатура <> &ПустаяНоменклатура)) КАК Продажи
	|
	|	СГРУППИРОВАТЬ ПО
	|
	|		Продажи.ДокументПродажи,
	|		Продажи.Период,
	|		Продажи.Номенклатура,
	|		Продажи.ДоговорКонтрагента.Владелец,
	|		Продажи.ДоговорКонтрагента.Владелец.ОсновнойМенеджерПокупателя
	|
	|	) КАК Продажи
	|//СОЕДИНЕНИЯ
	|
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(
	|		ВЫБРАТЬ
	|			СуммаСебестоимости.Номенклатура КАК Номенклатура,
	|			СуммаСебестоимости.Период       КАК Период,
	|			ВЫБОР КОГДА СуммаСебестоимости.КоличествоОборот = 0 ТОГДА
	|				0
	|			ИНАЧЕ
	|				СуммаСебестоимости.СтоимостьОборот/СуммаСебестоимости.КоличествоОборот
	|			КОНЕЦ КАК ЦенаНоменклатуры
	|		
	|		ИЗ
	|			(
	|			ВЫБРАТЬ
	|				ПродажиСебестоимость.Номенклатура            КАК Номенклатура,
	|				ПродажиСебестоимость.Период                  КАК Период,
	|				СУММА(ПродажиСебестоимость.СтоимостьОборот)  КАК СтоимостьОборот,
	|				СУММА(ПродажиСебестоимость.КоличествоОборот) КАК КоличествоОборот
	|				
	|			ИЗ
	|				РегистрНакопления.ПродажиСебестоимость.Обороты(&ДатаНачала, &ДатаОкончания, Месяц) КАК ПродажиСебестоимость
	|				
	|			СГРУППИРОВАТЬ ПО
	|				ПродажиСебестоимость.Номенклатура,
	|				ПродажиСебестоимость.Период
	|			
	|			)КАК СуммаСебестоимости
	|			
	|		) КАК ЦенаСебестоимости
	|		
	|	ПО
	|		Продажи.Номенклатура = ЦенаСебестоимости.Номенклатура
	|		И
	|		Продажи.Период = ЦенаСебестоимости.Период
	|
	|{ГДЕ
	|	Продажи.Номенклатура.* КАК Номенклатура,
	|	Продажи.Контрагент.* КАК Контрагент,
	|	Продажи.ОсновнойМенеджерПокупателя.* КАК ОсновнойМенеджерПокупателя
	|	//СВОЙСТВА
	|	//КАТЕГОРИИ
	|}
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи." + ОбъектАнализа + ",
	|	" + ?(ПараметрАнализа = "ИнтервалыМеждуРасходнымиДокументами", "Продажи.ДокументПродажи", "Продажи.Период") + "
	|
	|{УПОРЯДОЧИТЬ ПО
	|	Продажи.Номенклатура.* КАК Номенклатура,
	|	Продажи.Контрагент.* КАК Контрагент,
	|	Продажи.ОсновнойМенеджерПокупателя.* КАК ОсновнойМенеджерПокупателя
	|	//СВОЙСТВА
	|	}
	|
	|ИТОГИ ПО
	|	" + ?(ПараметрАнализа = "ИнтервалыМеждуРасходнымиДокументами", "ДокументПродажи", "Период Периодами(" + ПолучитьИмяЭлементаПеречисленияПоЗначению(Периодичность) + ", &ДатаНачала, &ДатаОкончания)") + "
	|{ИТОГИ ПО
	|	Продажи.Номенклатура.* КАК Номенклатура,
	|	Продажи.Контрагент.* КАК Контрагент,
	|	Продажи.ОсновнойМенеджерПокупателя.* КАК ОсновнойМенеджерПокупателя,
	|	Продажи.ДокументПродажи.* КАК ДокументПродажи
	|	//СВОЙСТВА
	|	}
	|
	|";
	
	ПостроительОтчета.Параметры.Вставить("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	ПостроительОтчета.Параметры.Вставить("ПустойДоговор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
	мСтруктураСоответствияИмен.Очистить();
	мСтруктураСоответствияИмен = Новый Структура("Номенклатура, Контрагент, ОсновнойМенеджерПокупателя, ДокументПродажи", "Номенклатура", "Контрагент", "Основной менеджер покупателя", "Расходный документ");
	
	мСоответствиеНазначений = Новый Соответствие;

	Если ИспользоватьСвойстваИКатегории Тогда
		
		ТаблицаПолей = Новый ТаблицаЗначений;
		ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и категории. Используется в условии соединения с регистром сведений, хранящим значения свойств или категорий
		ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
		ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
		ТаблицаПолей.Колонки.Добавить("ТипЗначения");  // тип значения поля, для которого добавляются свойства и категории. Используется, если не установлено назначение
		ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта

		НоваяСтрока = ТаблицаПолей.Добавить();
		НоваяСтрока.ПутьКДанным = "Продажи.Контрагент";
		НоваяСтрока.Представление = "Контрагент";
		НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты;

		НоваяСтрока = ТаблицаПолей.Добавить();
		НоваяСтрока.ПутьКДанным = "Продажи.Номенклатура";
		НоваяСтрока.Представление = "Номенклатура";
		НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;

		ТекстПоляКатегорий = "";
		ТекстПоляСвойств = "";

		// Добавим строки запроса, необходимые для использования свойств и категорий
		ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, мСтруктураСоответствияИмен, мСоответствиеНазначений, ПостроительОтчета.Параметры, , ТекстПоляКатегорий, ТекстПоляСвойств, , , , , , мСтруктураДляОтбораПоКатегориям);

	КонецЕсли;
	
	ПостроительОтчета.Текст = ТекстЗапроса;
	
	Если ИспользоватьСвойстваИКатегории Тогда
		УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, мСоответствиеНазначений, мСтруктураСоответствияИмен);
	КонецЕсли;
	
	ПостроительОтчета.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	
	ЗаполнитьПредставленияПолей(мСтруктураСоответствияИмен, ПостроительОтчета);
	
КонецПроцедуры


// Процедура заполняет табличный документ данными
//
// Параметры
//  Таб - поле табличного документа
//
// Возвращаемое значение
//  НЕТ
//
Процедура СформироватьОтчет(Таб) Экспорт

	Если Периодичность = Перечисления.Периодичность.ПустаяСсылка() Тогда
		Предупреждение("Укажите периодичность.");
		Возврат;
	КонецЕсли; 
	
	ДатаОкончания = КонецДня(ДатаОкончания);
	Если Периодичность = Перечисления.Периодичность.День ИЛИ Периодичность = Перечисления.Периодичность.Неделя Тогда
		
		мДатаНачала = НачалоДня(ДатаОкончания- КоличествоСекундПериода(Периодичность)*КоличествоПериодовАнализа) + 60*60*24;

	Иначе

		Если Периодичность = Перечисления.Периодичность.Месяц Тогда

			КолМесяцев = КоличествоПериодовАнализа;
		
		ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		
			КолМесяцев = КоличествоПериодовАнализа*3;
		
		ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		
			КолМесяцев = КоличествоПериодовАнализа*12;

		КонецЕсли;

		мДатаНачала = НайтиНачальнуюДатуПериодаМесяцев(ДатаОкончания, КолМесяцев);
		
	КонецЕсли;
	
	мИндексГруппировкиОбъекта = 0;
	
	Таб.Очистить();
	
	ПостроительОтчета.Параметры.Вставить("ДатаНачала", НачалоДня(мДатаНачала));
	ПостроительОтчета.Параметры.Вставить("ДатаОкончания", ?(ДатаОкончания = '00010101000000', ДатаОкончания, КонецДня(ДатаОкончания)));
	
	Если ПараметрАнализа = "ИнтервалыМеждуРасходнымиДокументами" И ПостроительОтчета.ВыбранныеПоля.Найти("ДокументПродажи") = Неопределено Тогда
		ПостроительОтчета.ВыбранныеПоля.Добавить("ДокументПродажи");
	КонецЕсли; 
	
	Если НЕ ЗадатьПараметрыОтбораПоКатегориям(ПостроительОтчета, мСтруктураДляОтбораПоКатегориям) Тогда
		Предупреждение("По одной категории нельзя устанавливать несколько отборов");
		Возврат;
	КонецЕсли;

	ПостроительОтчета.Выполнить();

	Макет = ПолучитьМакет("Макет");
	
	Таб.Очистить();

	Секция = Макет.ПолучитьОбласть("ШапкаВерх|КолонкаОсновная");
	Таб.Вывести(Секция);
	
	КоличествоПоказателей = 0;
	Для каждого Показатель Из Показатели Цикл
		Если Показатель.Использование Тогда
			КоличествоПоказателей = КоличествоПоказателей + 1;
		КонецЕсли; 
	КонецЦикла; 
	
	ПоследнийСтолбецОтчета = КоличествоПоказателей + 3;

	Секция = Макет.ПолучитьОбласть("ШапкаИнтервал|КолонкаОсновная");
	Секция.Параметры.СтрокаИнтервал = СформироватьСтрокуПериода();
	Таб.Вывести(Секция);
	Таб.Область(1, 2, 4, ПоследнийСтолбецОтчета).ПоВыделеннымКолонкам = Истина;
	мКоличествоВыведенныхСтрокЗаголовка = 4;
	
	ПоследняяСтрока = 4;
	СтрокаГруппировок = СформироватьСтрокуИзмерений(ПостроительОтчета.ИзмеренияСтроки);
	Если НЕ ПустаяСтрока(СтрокаГруппировок) Тогда
		ПоследняяСтрока = ПоследняяСтрока + 1;
		СтрокаГруппировок = "Группировки строк: " + СтрокаГруппировок;
		Секция = Макет.ПолучитьОбласть("ШапкаГруппировки|КолонкаОсновная");
		Секция.Параметры.СтрокаГруппировок = СтрокаГруппировок;
		Таб.Вывести(Секция);
		Таб.Область(ПоследняяСтрока, 2, ПоследняяСтрока, ПоследнийСтолбецОтчета).ПоВыделеннымКолонкам = Истина;
		мКоличествоВыведенныхСтрокЗаголовка = мКоличествоВыведенныхСтрокЗаголовка + 1;
	КонецЕсли; 

	СтрокаОтборов = "";
	Если ОтборФлагКласс Тогда
		Если ОтборВидСравненияКласс = ВидСравнения.Равно Тогда
			СтрокаОтборов = СтрокаОтборов + "XYZ-класс = "+ СокрЛП(Строка(ОтборЗначениеКласс));
		ИначеЕсли ОтборВидСравненияКласс = ВидСравнения.НеРавно Тогда
			СтрокаОтборов = СтрокаОтборов + "XYZ-класс <> "+ СокрЛП(Строка(ОтборЗначениеКласс));
		ИначеЕсли ОтборВидСравненияКласс = ВидСравнения.ВСписке Тогда
			СтрокаСписка = "";
			Для каждого ЭлементСписка Из ОтборЗначениеКласс Цикл
				Если НЕ ПустаяСтрока(СтрокаСписка) Тогда
					СтрокаСписка = СтрокаСписка + "; ";
				КонецЕсли; 
				СтрокаСписка = СтрокаСписка + СокрЛП(Строка(ЭлементСписка.Значение));
			КонецЦикла; 
			СтрокаОтборов = СтрокаОтборов + "XYZ-класс в списке "+ СтрокаСписка;
		ИначеЕсли ОтборВидСравненияКласс = ВидСравнения.НеВСписке Тогда
			СтрокаСписка = "";
			Для каждого ЭлементСписка Из ОтборЗначениеКласс Цикл
				Если НЕ ПустаяСтрока(СтрокаСписка) Тогда
					СтрокаСписка = СтрокаСписка + "; ";
				КонецЕсли; 
				СтрокаСписка = СтрокаСписка + СокрЛП(Строка(ЭлементСписка.Значение));
			КонецЦикла; 
			СтрокаОтборов = СтрокаОтборов + "XYZ-класс не в списке "+ СтрокаСписка;
		КонецЕсли;
	КонецЕсли; 
	
	СтрокаОтборов = СтрокаОтборов + ?(Не ПустаяСтрока(СтрокаОтборов), ", ", "") + СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
	Если НЕ ПустаяСтрока(СтрокаОтборов) Тогда
		ПоследняяСтрока = ПоследняяСтрока + 1;
		СтрокаОтборов = "Отбор: " + СтрокаОтборов;
		Секция = Макет.ПолучитьОбласть("ШапкаОтбор|КолонкаОсновная");
		Секция.Параметры.СтрокаОтборов = СтрокаОтборов;
		Таб.Вывести(Секция);
		Таб.Область(ПоследняяСтрока, 2, ПоследняяСтрока, ПоследнийСтолбецОтчета).ПоВыделеннымКолонкам = Истина;
		мКоличествоВыведенныхСтрокЗаголовка = мКоличествоВыведенныхСтрокЗаголовка + 1;
	КонецЕсли; 
	
	СтрокаПорядка = СформироватьСтрокуПорядка(ПостроительОтчета.Порядок);
	Если НЕ ПустаяСтрока(СтрокаПорядка) Тогда
		ПоследняяСтрока = ПоследняяСтрока + 1;
		СтрокаПорядка = "Сортировка: " + СтрокаПорядка;
		Секция = Макет.ПолучитьОбласть("ШапкаПорядок|КолонкаОсновная");
		Секция.Параметры.СтрокаПорядка = СтрокаПорядка;
		Таб.Вывести(Секция);
		Таб.Область(ПоследняяСтрока, 2, ПоследняяСтрока, ПоследнийСтолбецОтчета).ПоВыделеннымКолонкам = Истина;
		мКоличествоВыведенныхСтрокЗаголовка = мКоличествоВыведенныхСтрокЗаголовка + 1;
	КонецЕсли;
	
	Если ПостроительОтчета.ИзмеренияСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ГруппировкаОбъекта = ПостроительОтчета.ИзмеренияСтроки.Найти(ОбъектАнализа);
	Если ГруппировкаОбъекта = Неопределено Тогда
		ФормаОтчета = ЭтотОбъект.ПолучитьФорму("Форма");
		ПредставлениеОбъектаАнализа = ФормаОтчета.ЭлементыФормы.ОбъектАнализа.СписокВыбора.НайтиПоЗначению(ОбъектАнализа).Представление;
		Предупреждение("Группировка по объекту анализа """ + ПредставлениеОбъектаАнализа + """, должна присутствовать обязательно!");
		Возврат;
	Иначе
		мИндексГруппировкиОбъекта = ПостроительОтчета.ИзмеренияСтроки.Индекс(ГруппировкаОбъекта);
	КонецЕсли; 

	Секция = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаОсновная");
	Таб.Вывести(Секция);
	
	Для каждого Показатель Из Показатели Цикл
		Если Показатель.Использование Тогда
			Секция = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаПоказатель");
			Секция.Параметры.ИмяПоказателя = Показатель.Представление;
			Таб.Присоединить(Секция);
		КонецЕсли; 
	КонецЦикла; 
	
	РезультатЗапроса = ПостроительОтчета.Результат;
	
	ТаблицаКлассовОбъектов = Новый ТаблицаЗначений;
	ТаблицаКлассовОбъектов.Колонки.Добавить("Объект");
	ТаблицаКлассовОбъектов.Колонки.Добавить("Класс", Новый ОписаниеТипов("ПеречислениеСсылка.XYZКлассификация"));
	ТаблицаКлассовОбъектов.Колонки.Добавить("КоэффициентВариации", ПолучитьОписаниеТиповЧисла(15,2));
	Для каждого Показатель Из Показатели Цикл
		ТаблицаКлассовОбъектов.Колонки.Добавить(Показатель.Имя, ПолучитьОписаниеТиповЧисла(15,2));
	КонецЦикла;
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	// Заполним данные для возможной диаграммы, дерево значений
	ТаблицаДиаграммы = Новый ТаблицаЗначений;
	Если ОбъектАнализа = "Контрагент" Тогда
		ТаблицаДиаграммы.Колонки.Добавить("Объект", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ИначеЕсли ОбъектАнализа = "Номенклатура" Тогда
		ТаблицаДиаграммы.Колонки.Добавить("Объект", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Иначе
		ТаблицаДиаграммы.Колонки.Добавить("Объект", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	КонецЕсли; 
	ТаблицаДиаграммы.Колонки.Добавить("Класс", Новый ОписаниеТипов("ПеречислениеСсылка.XYZКлассификация"));
	Для каждого Показатель Из Показатели Цикл
		Если Показатель.Использование Тогда
			ТаблицаДиаграммы.Колонки.Добавить(Показатель.Имя, Новый ОписаниеТипов("Число"));
		КонецЕсли; 
	КонецЦикла; 
	
	ВывестиСтроки(Таб, Макет, РезультатЗапроса, 0, ТаблицаКлассовОбъектов, ТаблицаДиаграммы);
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Таб.ФиксацияСверху = мКоличествоВыведенныхСтрокЗаголовка + 2;
	Таб.ФиксацияСлева = 2;

	ИзменитьВидимостьЗаголовка(Таб);
	
	Таб.ТолькоПросмотр = Истина;
	Таб.Показать();
	
КонецПроцедуры

// Процедура подготавливает данные для вывода строк в ПолеТабличногоДокумента
// 
// Параметры
//  Таб                                 - ПолеТабличногоДокумента, в котором показывать данные отчета
//  Макет                               - макет отчета
//  ТекущаяВыборка                      - выборка запроса, из которой выводить строки
//  ИндексТекущейГруппировки            - число, индекс выводимой группировки
//  ТаблицаКлассовОбъектов              - ТаблицаЗначений, в которую записываются данные о распределенных объектах по классам
//  СтруктураЗначенийВерхнихГруппировок - Структура, в которой передаются параметры верхних, уже выведенных в табличный документ,
//                                        группировок, для ссуммирования показателей при установленном отборе по АВС-классам
// 
// Возвращаемое значение
//  НЕТ
// 
Процедура ВывестиСтроки(Таб, Макет, ТекущаяВыборка, ИндексТекущейГруппировки, ТаблицаКлассовОбъектов, ТаблицаДиаграммы, СтруктураЗначенийВерхнихГруппировок = Неопределено)

	Если ИндексТекущейГруппировки > ПостроительОтчета.ИзмеренияСтроки.Количество()-1 Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеГруппировки = ПостроительОтчета.ИзмеренияСтроки[ИндексТекущейГруппировки].Имя;
	
	// Если добавить в группировки строк одинаковые значения, то в именах групировок
	// добавляется цифра 1,2,3..., а поля таблицы запроса естественно не добавляются с такими именами
	// поэтому из имени группировки удилим последние цифры в имени
	
	а = СтрДлина(НаименованиеГруппировки);
	Пока а > 0 Цикл
		Если КодСимвола(Сред(НаименованиеГруппировки, а, 1)) >= 49 И КодСимвола(Сред(НаименованиеГруппировки, а, 1)) <= 57 Тогда
			а = а - 1;
			Продолжить;
		КонецЕсли;
		Прервать;
	КонецЦикла;
	
	НаименованиеГруппировки = Лев(НаименованиеГруппировки, а);

	Выборка = ТекущаяВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, НаименованиеГруппировки);

	Если НаименованиеГруппировки = ОбъектАнализа Тогда
		
		ТаблицаКлассовОбъектов.Очистить();
		ЗаполнитьТаблицуКлассовОбъектов(ТекущаяВыборка, ТаблицаКлассовОбъектов);
		
		ПрошлыйКласс = Неопределено;
		Для каждого СтрокаТаблицыКлассов Из ТаблицаКлассовОбъектов Цикл
			
			Если НЕ ПроверитьКлассВОтборе(СтрокаТаблицыКлассов.Класс) Тогда
				Продолжить;
			КонецЕсли; 
			
			Если СтрокаТаблицыКлассов.Класс <> ПрошлыйКласс Тогда
				
				ПрошлыйКласс = СтрокаТаблицыКлассов.Класс;
				
				СтруктураЗначений = Новый Структура;
				СтрокиКласса = ТаблицаКлассовОбъектов.НайтиСтроки(Новый Структура("Класс", СтрокаТаблицыКлассов.Класс));
				Для каждого СтрокаКласса Из СтрокиКласса Цикл
					Для каждого Показатель Из Показатели Цикл
						Если Показатель.Использование Тогда
							Если СтруктураЗначений.Свойство(Показатель.Имя) Тогда
								СтруктураЗначений[Показатель.Имя] = СтруктураЗначений[Показатель.Имя] + СтрокаКласса[Показатель.Имя];
							Иначе
								СтруктураЗначений.Вставить(Показатель.Имя, СтрокаКласса[Показатель.Имя]);
							КонецЕсли; 
						КонецЕсли; 
					КонецЦикла; 
				КонецЦикла; 
				
				Если ТипЗнч(СтруктураЗначенийВерхнихГруппировок) = Тип("Структура") Тогда
					Для каждого ЭлементСтруктуры Из СтруктураЗначенийВерхнихГруппировок Цикл
						Если СтруктураЗначений.Свойство(ЭлементСтруктуры.Ключ) Тогда
							Если ТипЗнч(СтруктураЗначенийВерхнихГруппировок[ЭлементСтруктуры.Ключ]) = Тип("Число") Тогда
								СтруктураЗначенийВерхнихГруппировок[ЭлементСтруктуры.Ключ] = СтруктураЗначенийВерхнихГруппировок[ЭлементСтруктуры.Ключ] + СтруктураЗначений[ЭлементСтруктуры.Ключ];
							Иначе
								СтруктураЗначенийВерхнихГруппировок[ЭлементСтруктуры.Ключ] = СтруктураЗначений[ЭлементСтруктуры.Ключ];
							КонецЕсли; 
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли; 
				
				ВывестиСтрокуГруппировки(СтрокаТаблицыКлассов, "Класс", Макет, ИндексТекущейГруппировки, Таб, СтруктураЗначений);
				
			КонецЕсли;
			
			Выборка.Сбросить();
			Если НЕ Выборка.НайтиСледующий(Новый Структура(НаименованиеГруппировки, СтрокаТаблицыКлассов.Объект)) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДиаграммы = ТаблицаДиаграммы.Добавить();
			СтрокаДиаграммы.Объект = Выборка[НаименованиеГруппировки];
			СтрокаДиаграммы.Класс  = ПрошлыйКласс;
			
			ВывестиСтрокуГруппировки(Выборка, НаименованиеГруппировки, Макет, ИндексТекущейГруппировки, Таб, ТаблицаКлассовОбъектов.Скопировать(), СтрокаДиаграммы);
			ВывестиСтроки(Таб, Макет, Выборка, ИндексТекущейГруппировки+1, ТаблицаКлассовОбъектов, ТаблицаДиаграммы);
			
		КонецЦикла; 
		
	Иначе
		
		СтруктураНокопленияЗначений = Новый Структура;
		Для каждого Показатель Из Показатели Цикл
			Если Показатель.Использование Тогда
				СтруктураНокопленияЗначений.Вставить(Показатель.Имя, 0);
			КонецЕсли; 
		КонецЦикла; 
		
		Пока Выборка.Следующий() Цикл

			СтруктураЗначенийВерхнихГруппировок = Неопределено;
			ВывестиСтрокуГруппировки(Выборка, НаименованиеГруппировки, Макет, ИндексТекущейГруппировки, Таб, СтруктураЗначенийВерхнихГруппировок);
			
			СтараяСтруктураЗначенийВерхнихГруппировок = Новый Структура;
			Если ТипЗнч(СтруктураЗначенийВерхнихГруппировок) = Тип("Структура") Тогда
				Для каждого ЭлементСтруктуры Из СтруктураЗначенийВерхнихГруппировок Цикл
					СтараяСтруктураЗначенийВерхнихГруппировок.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
				КонецЦикла; 
			КонецЕсли; 
			
			ВывестиСтроки(Таб, Макет, Выборка, ИндексТекущейГруппировки+1, ТаблицаКлассовОбъектов, ТаблицаДиаграммы, СтруктураЗначенийВерхнихГруппировок);
			
			Если ТипЗнч(СтараяСтруктураЗначенийВерхнихГруппировок) = Тип("Структура") Тогда
				Для каждого ЭлементСтруктуры Из СтруктураЗначенийВерхнихГруппировок Цикл
					Если СтараяСтруктураЗначенийВерхнихГруппировок.Свойство(ЭлементСтруктуры.Ключ) Тогда
						СтараяСтруктураЗначенийВерхнихГруппировок[ЭлементСтруктуры.Ключ].Текст = Формат((Число(СтараяСтруктураЗначенийВерхнихГруппировок[ЭлементСтруктуры.Ключ].Текст) + ЭлементСтруктуры.Значение), "ЧЦ=20; ЧДЦ=2; ЧРД=,");
						СтруктураНокопленияЗначений[ЭлементСтруктуры.Ключ] = СтруктураНокопленияЗначений[ЭлементСтруктуры.Ключ] + ЭлементСтруктуры.Значение;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли;
			
		КонецЦикла; 
		
		СтруктураЗначенийВерхнихГруппировок = СтруктураНокопленияЗначений;
		
	КонецЕсли; 

КонецПроцедуры

// Процедура выводит строки в ПолеТабличногоДокумента
// 
// Параметры
//  Выборка                  - Выборка запроса, из которой выводить строки
//  НаименованиеГруппировки  - Строка, имя текущей группировки
//  Макет                    - макет отчета
//  ИндексТекущейГруппировки - число, индекс выводимой группировки
//  Таб                      - ПолеТабличногоДокумента, в котором показывать данные отчета
//  СтруктураЗначений        - Структура, в которую записыватся данные о выведенных строках в табличный документ
// 
// Возвращаемое значение
//  НЕТ
// 
Процедура ВывестиСтрокуГруппировки(Выборка, НаименованиеГруппировки, Макет, ИндексТекущейГруппировки, Таб, СтруктураЗначений = Неопределено, СтрокаДиаграммы = Неопределено)

	СтрокаВывода = СокрЛП(Строка(Выборка[НаименованиеГруппировки]));
	Если ПустаяСтрока(СтрокаВывода) Тогда
		СтрокаВывода = "<...>";
	КонецЕсли;
	
	Если ИндексТекущейГруппировки >= мИндексГруппировкиОбъекта Тогда
		Если НаименованиеГруппировки = "Класс" Тогда
			РеальныйИндексТекущейГруппировки = ИндексТекущейГруппировки;
		Иначе
			РеальныйИндексТекущейГруппировки = ИндексТекущейГруппировки + 1;
		КонецЕсли; 
	Иначе
		РеальныйИндексТекущейГруппировки = ИндексТекущейГруппировки;
	КонецЕсли; 

	ТекущийЦвет = Новый Цвет;
	Если РаскрашиватьГруппировки Тогда
		Если РеальныйИндексТекущейГруппировки <> ПостроительОтчета.ИзмеренияСтроки.Количество() Тогда
			ИндексЦвета = РеальныйИндексТекущейГруппировки;
			Если ИндексЦвета >= 10 Тогда
				ИндексЦвета = (РеальныйИндексТекущейГруппировки/10 - Цел(РеальныйИндексТекущейГруппировки/10))*10;
			КонецЕсли; 
			ТекущийЦвет = Макет.Области["Цвет"+СокрЛП(Строка(ИндексЦвета))].ЦветФона;
		Иначе
			ТекущийЦвет = Новый Цвет;
		КонецЕсли; 
	КонецЕсли;
	
	Секция = Макет.ПолучитьОбласть("СтрокаГруппировки|КолонкаОсновная");
	Секция.Параметры.ЗначениеГруппировки = СтрокаВывода;
	Секция.Области.ЗначениеГруппировки.ЦветФона = ТекущийЦвет;
	Секция.Области.ЗначениеГруппировки.Отступ = РеальныйИндексТекущейГруппировки;
	Секция.Области.ЗначениеГруппировки.Расшифровка = Выборка[НаименованиеГруппировки];
	Если НаименованиеГруппировки = "Класс" Тогда
		Секция.Области.ЗначениеГруппировки.Шрифт = Новый Шрифт(,,Истина);
	КонецЕсли;
	
	Секция.Области.ЗначениеКоэффициентаВариации.ЦветФона = ТекущийЦвет;
	Если ТипЗнч(СтруктураЗначений) = Тип("ТаблицаЗначений") Тогда
		СтрокаКонтрагента = СтруктураЗначений.Найти(Выборка[НаименованиеГруппировки], "Объект");
		Если СтрокаКонтрагента <> Неопределено Тогда
			Секция.Параметры.ЗначениеКоэффициентаВариации = Формат(СтрокаКонтрагента.КоэффициентВариации, "ЧЦ=20; ЧДЦ=3; ЧРД=,");
		КонецЕсли; 
	КонецЕсли;
	Таб.Вывести(Секция, РеальныйИндексТекущейГруппировки);
	
	СтруктураВозвратаЗначений = Новый Структура;
	Для каждого Показатель Из Показатели Цикл
		Если Показатель.Использование Тогда
			Секция = Макет.ПолучитьОбласть("СтрокаГруппировки|КолонкаПоказатель");
			Если ТипЗнч(СтруктураЗначений) = Тип("Структура") Тогда
				Секция.Параметры.ЗначениеПоказателя = Формат(СтруктураЗначений[Показатель.Имя], "ЧЦ=20; ЧДЦ=2; ЧРД=,");
				Если СтрокаДиаграммы <> Неопределено Тогда
					СтрокаДиаграммы[Показатель.Имя] = СтруктураЗначений[Показатель.Имя];
				КонецЕсли; 
			Иначе
				Секция.Параметры.ЗначениеПоказателя = Формат(Выборка[Показатель.Имя], "ЧЦ=20; ЧДЦ=2; ЧРД=,");
				Если СтрокаДиаграммы <> Неопределено Тогда
					СтрокаДиаграммы[Показатель.Имя] = Выборка[Показатель.Имя];
				КонецЕсли; 
			КонецЕсли;
			Секция.ТекущаяОбласть.ЦветФона = ТекущийЦвет;
			ОбластьЯчеекТаблицы = Таб.Присоединить(Секция, РеальныйИндексТекущейГруппировки);
			Если ИндексТекущейГруппировки < мИндексГруппировкиОбъекта Тогда
				ОбластьЯчеекТаблицы.Текст = "0";
				СтруктураВозвратаЗначений.Вставить(Показатель.Имя, ОбластьЯчеекТаблицы);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	СтруктураЗначений = СтруктураВозвратаЗначений;

КонецПроцедуры

// Сформируем список объектов анализа отчета
мСписокОбъектов = Новый СписокЗначений;
мСписокОбъектов.Добавить("Контрагент", "Контрагент");
мСписокОбъектов.Добавить("Номенклатура", "Номенклатура");
мСписокОбъектов.Добавить("ОсновнойМенеджерПокупателя", "Основной менеджер покупателя");

мСтруктураСоответствияИмен = Новый Структура;

// Заполним таблицу возможных для отображения показателей отчета
НовыйПоказатель = Показатели.Добавить();
НовыйПоказатель.Имя = "СуммаВыручки";
НовыйПоказатель.Представление = "Сумма выручки в валюте упр.учета (" + Константы.ВалютаУправленческогоУчета.Получить() + ")";

НовыйПоказатель = Показатели.Добавить();
НовыйПоказатель.Имя = "СуммаВаловойПрибыли";
НовыйПоказатель.Представление = "Сумма валовой прибыли в валюте упр.учета (" + Константы.ВалютаУправленческогоУчета.Получить() + ")";

НовыйПоказатель = Показатели.Добавить();
НовыйПоказатель.Имя = "КоличествоПроданныхТоваров";
НовыйПоказатель.Представление = "Количество проданных товаров";

мКоличествоВыведенныхСтрокЗаголовка = 0;
мИндексГруппировкиОбъекта = 0;

мДатаНачала = '00010101000000';
